---
kind: other
id: Properties.T:Autodesk.Revit.DB.SpatialElementBoundaryOptions
source: html/504d2176-1cb7-3e07-4c69-c480eb80bc1f.htm
---
# SpatialElementBoundaryOptions Properties

Specifies whether the .NET object represents a valid Revit entity.